{
    "parties":  [{
                    "objectId": "relay",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/relay.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/relay.jpg",
                    "title": "RelayCon: WWDC 2016",
                    "startDate": "2016-06-13T18:00",
                    "endDate": "2016-06-13T20:30",
                    "details": "On June 13 at 6 PM we will be hosting an event at 111 Minna Street in San Francisco. Come grab a drink at the bar and hang out before a live panel starts covering that morning's news. Hosts from Connected will be joined by Serenity Caldwell and Jason Snell.\nAre there ID requirements or an age limit to enter the event?\nYes. The event will include an open bar, and as such, is ages 21 and up. You will be required to show an ID to enter.\nWill I be able to touch Myke's beard?\nNo. Well, maybe. (Did we mention there's an open bar?)\nWhat if I can't make it?\nWhile that question makes us sad, we will be releasing the audio of the panel as that week's Connected episode. But you can't touch Myke's beard through your podcast player.",
                    "address1": "111 Minna Gallery",
                    "address2": "111 Minna Street",
                    "address3": "San Francisco, CA 94105",
                    "latitude": 37.78731,
                    "longitude": -122.39937,
                    "url": "https://www.eventbrite.com/e/relaycon-wwdc-2016-tickets-21418547452"
                },{
                    "objectId": "hike",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/hike.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/hike.jpg",
                    "title": "WWDC Hike 2016",
                    "startDate": "2016-06-12T14:00",
                    "endDate": "2016-06-12T18:00",
                    "details": "When\nJune 12th, 2016, the Sunday before WWDC. We'll leave at 2pm.\n\nWhere\nWe'll leave from Lands End. It's about a 20 minute drive from the Moscone. If you drive, you'll have to cab back to your car at the end since the route isn't a loop.\n\nHiking\nIt will take about 3-4 hours to hike 6.2 miles (10km). The terrain ranges from dirt trails, streets, and beaches. Comfortable walking shoes are recommended.\n\nWe'll see Lands End, Baker Beach, the Golden Gate Bridge, Crissy Field, and Fort Mason along the way. Click the pins on the map for details of each spot. We'll finish at In-N-Out in Fisherman's Wharf. Anyone that wants to stay and eat is welcome.\n\nDon't feel like you have to do all of it. You're more than welcome to come, hike for a bit, and cab back to downtown when you're feeling done.",
                    "address1": "Lands End",
                    "address2": "680 Point Lobos Ave",
                    "address3": "San Francisco, CA 94121",
                    "latitude": 37.785443,
                    "longitude": -122.50618,
                    "url": "http://wwdchike.com"
                },{
                    "objectId": "diversion",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/diversion.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/diversion.jpg",
                    "title": "WWDC Diversion",
                    "startDate": "2016-06-15T19:00",
                    "endDate": "2016-06-15T22:00",
                    "details": "It wouldn't be WWDC without a little Diversion!\nCome join your friends from Apteligent & Localytics for the 3rd annual WWDC Diversion Party at 620 Jones on Wednesday, June 15th.  \nMingle over some cocktails, reconnect with old colleagues, make new connections or just enjoy the ambiance. Whatever your reason, this is the place to be.\nThis can't-miss event has sold out in prior years, so don't be left in the dust. Get your ticket today!\n\n* You must be 21 or older to attend.",
                    "address1": "Jones",
                    "address2": "620 Jones Street",
                    "address3": "San Francisco, CA 94102",
                    "latitude": 37.78718,
                    "longitude": -122.41299,
                    "url": "https://www.eventbrite.com/e/wwdc--tickets-25098636698"
                },{
                    "objectId": "appstorey",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/appstorey.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/appstorey.jpg",
                    "title": "Party — AppStorey",
                    "startDate": "2016-06-15T20:00",
                    "endDate": "2016-06-15T23:00",
                    "details": "You know the computer. Tell your NeXTSTEP story to AppStorey at the AppStorey WWDC Party! This is your chance to learn about, or even contribute to the making of the AppStorey video documentary. We're going to set the record straight. Voice your unique point of view to the making of history's greatest copmuter, and help tell how this one copmuter made a collosal impact on today's mobile computing world. You were part of computer history. AppStorey T-shirts will be available to those who qualify for full or partial video interviews. Professional photographers, producers will be there to capture it all so dont miss out!",
                    "address1": "Tommy's Mexican",
                    "address2": "5929 Geary Blvd",
                    "address3": "San Francisco, CA 94121",
                    "latitude": 37.77987,
                    "longitude": -122.48313,
                    "url": "https://www.eventbrite.com/e/party-appstorey-the-untold-story-of-historys-greatest-computer-tickets-25419877538"
                },{
                    "objectId": "linkedin",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/linkedin.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/linkedin.jpg",
                    "title": "WWDC Watching Party",
                    "startDate": "2016-06-13T09:00",
                    "endDate": "2016-06-13T16:00",
                    "details": "Didn't get lucky enough to get a WWDC ticket this year? Don't worry, LinkedIn's got you covered - we're hosting a WWDC watching party from our SF office all day Monday - Thursday.\nOn Monday we’ll watch the keynote. After it ends, we'll serve lunch and give you the chance to mingle with other iOS devs in the community. After lunch, stick around to watch the Platforms State of the Union.\nTuesday, Wednesday and Thursday, we’ll be watching the live sessions. Come and hang out with us and talk about what’s new this year (lunch not provided these days).\n\nRegistration\nWhen registering for tickets, please RSVP only for dates you plan on attending. You'll need a separate ticket for each day.\n\nSchedule\n(subject to change since the WWDC schedule isn't out yet)\n\nMonday\n9am - 10am: Check in\n10am - 12pm: Watch WWDC Keynote\n12pm - 2:30pm: Lunch & Networking\n2:30pm - 4:00pm: Watch Platforms State of The Union\n\nTuesday\n9am - 5pm: Watching the live sessions.\n\nWednesday\n9am - 5pm: Watching the live sessions.\n\nThursday\n9am - 3pm: Watching the live sessions\n3pm - ?: Happy hour at a near-by bar. No ticket required. (Not sponsored by LinkedIn)\n\nFAQs\nAre there ID requirements or an age limit to enter the event?\nNo. All ages are welcome for the events at LinkedIn. For the Thursday happy hour, you are subject to the rules of the bar (which bar is TBD).\n\nWhat are my transport/parking options getting to the event?\nWe highly recommend taking public transit, biking, or using a rideshare service as onsite parking is very limited.\nPublic transit: Muni bus 10 stops right in front of our building! We're also walking distance from the Montgomery BART/Muni rail station\nBikes: utilize the parking garage ramp down to the secured bike rooms (Please enter on Tehama Street). DO NOT bring bikes into the building lobby\nCars: Daily rate $25, Garage hours 7am-7pm\n\nWhere can I contact the organizer with any questions?\nEmail wwdc2016@linkedin.com",
                    "address1": "LinkedIn",
                    "address2": "222 2nd St",
                    "address3": "San Francisco, CA 94105",
                    "latitude": 37.78634,
                    "longitude": -122.39825,
                    "url": "https://www.eventbrite.com/e/wwdc-watching-party-linkedin-sf-tickets-25433777112"
                },{
                    "objectId": "originate",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/originate.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/originate.jpg",
                    "title": "Ballmer Peak-A-Thon",
                    "startDate": "2016-06-17T17:00",
                    "endDate": "2016-06-17T22:00",
                    "details": "Originate are once again hosting the Ballmer Peak-A-Thon!\nYou will have 5 hours to find the elusive Ballmer Peak, and build the best worst business possible. We will provide a full bar, bartender, food and plenty of silly domain names to jump start the festivities.\nHow does it work? Simple:\nPick a domain name from our list.\nHack anything... as long as it fits your domain.\nShow it off!\nThe Details:\nHardware - BYOL (Bring your own laptop), unless you want to code on a whiteboard or something.\nWorkflow - Five hours isn't a lot of time. Don't spend it tracking down SDK's or fighting with MongoDB - come prepared!\nBallmer PEAK, not Ballmer GUTTER - Our goal is to drink and code, not blackout and vom. Know your limits and everyone will have a good time. Ignore your limits and you may find more-than-embarrassing photos on reddit the next day.\nTransportation - We'll have fun at the event, but be sober before you go anywhere. Even better… Uber.",
                    "address1": "Originate",
                    "address2": "580 Market St",
                    "address3": "San Francisco, CA 94104",
                    "latitude": 37.78948,
                    "longitude": -122.40147,
                    "url": "https://www.eventbrite.com/e/ballmer-peak-a-thon-an-open-bar-hackathon-tickets-25487583047"
                },{
                    "objectId": "realm",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/realm.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/realm.jpg",
                    "title": "WWDC Livestreamed Swift Panel",
                    "startDate": "2016-06-13T18:30",
                    "endDate": "2016-06-13T20:30",
                    "details": "NOTE:  The event is first-come, first-served.\n\nWe wish we had enough space for everyone, but we can only safely have so many people inside at once.\n\nTo make it fair for those who RSVP, we will be checking names at the door. Thanks! \n\n\n\n\n\nWelcome to Monday Night Live! Now 100% Swift!\n\n(Or maybe 98%, there's so much to talk about & we shouldn't restrict ourselves.)\n\nFeaturing a panel discussion with: \n\n• Natasha Murashev, aka Natasha The Robot  \n\n• Ayaka Nonaka, ‎iOS at Workflow  \n\n• Ben Sandofsky, longtime software shipper \n\n• Jesse Squires, iOS at Instagram \n\nThe panel will kick off with a retrospective into the last couple years of Swift, move to discussing this year’s developments across open source & WWDC, and end with your questions.\n\n\n\nLivestreaming:\n\nWe will be live streaming the entire event! We hope that everyone, everywhere will be able to enjoy this panel.\n\nCheck back here on the day of the event to find the link.\n\nIn case you can't watch the live stream, don't worry! We're also recording the event, and we'll be posting the video shortly after the event. Sign up here to be emailed when the video goes up.\n\n\n\nPanelist Bios: \n\nNatasha Murashev \n\nNatasha is an iOS developer by day and a robot by night. She blogs about Swift, watchOS, and iOS development on her blog, natashatherobot.com, curates a fast-growing weekly Swift newsletter, This Week in Swift, and organizes the try! Swift Conference around the world (the next one is in NYC!). She's currently living the digital nomad life as her alter identity: @NatashaTheNomad. \n\nAyaka Nonaka \n\nAyaka is an iOS engineer at Workflow, and was previously at Venmo on their iOS team. She’s a huge fan of Swift and has given talks on natural language processing in Swift, scripting in Swift, and a few other things. Recently she’s been writing at Learn Swift ↯ to show how powerful the language can be. \n\nBen Sandofsy\n\nBen has shipped software for over a decade, from tiny startups to giant enterprise companies.  He's worked on Periscope, Twitter for iPhone, and Twitter for Mac. He's a CodePath instructor, an advisor to Shyp, and was a technical consultant for HBO's Silicon Valley. On Wednesday, catch his AltConf talk, “Building Periscope Sketches.” \n\nJesse Squires\n\nJesse is a software developer who works on iOS at Instagram. He writes about Swift and Objective‑C on his blog at jessesquires.com, and contributes to many open source projects on GitHub. He loves running and learning new things, and is fueled primarily by black coffee and black metal.\n\nAbout your Moderator: JP Simard  \n\nJP is an Objective-C and Swift engineer at Realm, a fast mobile database. He’s also the creator of jazzy (the Swift and Objective-C documentation tool Apple forgot to release) and a co-organizer of the SLUG (i.e., this meetup), which is the largest Swift user group in the world.\n\n\n\nSchedule:   \n\n6:00pm: Doors open for people with confirmed RSVPs.  \n\n6:30 - 7:00pm: Refreshments and food. Food will include options for omnivores, vegans, and gluten-free folks. We will not be serving alcohol at this meetup, but we'll have plenty of soda options.\n\n6:45pm: Doors open to waitlisted people!\n\n7:00pm:  Panel + Q&A\n\nAfterward, you're welcome to stay and chat. \n\n\n\nLocation:\n\nIt's just a 15-minute walk from Moscone, down toward AT&T Park.\n\nThe Realm office is on Townsend St. between 2nd and 3rd. \n\nLook for the door-person standing outside the building. He or she will guide you up. \n\nGetting there:  \n\n•  5-minute walk to the King St. Caltrain station. 20-minute walk from the Powell St. BART Station.\n\n•  The building entrance is next to the parking garage. \n\n•  Bike Parking: You're welcome to bring your bike inside, but you'll need to carry it to the 2nd floor.\n\n• Please note that the building doesn't have an elevator so the venue isn't handicap-accessible unfortunately. \n\n\n\nThanks to: \n\nRealm for hosting and providing food + drinks.\n\nQuestions? \n\nEmail Chris at ck@realm.io.",
                    "address1": "Realm",
                    "address2": "148 Townsend St",
                    "address3": "San Francisco, CA 94107",
                    "latitude": 37.78002,
                    "longitude": -122.39216,
                    "url": "http://www.meetup.com/swift-language/events/231196358/"
                },{
                    "objectId": "nshipster",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/realm.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/realm.jpg",
                    "title": "NSHipster Pub Quiz!",
                    "startDate": "2016-06-14T18:30",
                    "endDate": "2016-06-14T21:00",
                    "details": "PLEASE NOTE:  The event is first-come, first-served – only the first 200 will be admitted. RSVPing is required but does not guarantee entry. \n\nWe wish we had enough space for everyone, but we can only safely have so many people inside at once.\n\nTo make it fair for those who RSVP, we will be checking names at the door. Thanks! \n\n\n\nJoin NSHipster at Realm HQ for the eighth annual edition of the NSHipster Pub Quiz! \n\n\n\nWhat?\n\nJoin us for the eighth edition of the NSHipster Pub Quiz! You'll answer four rounds of ten questions each, challenging your knowledge of Objective-C, Swift, and Cocoa, along with all things Apple, from the prosaic to the arcane. Come with a team or figure it out when you get there – in either case, space is limited, so RSVP now!\n\nCome by Realm HQ for delicious food and drinks starting at 6:30. The quiz starts once everyone has teamed up and settled in, around 7:30. Stick around afterwards to gloat or commiserate, or just to catch up with your fellow NSHipsters.\n\nAll ages are welcome! We will have plenty of non-alcoholic drinks in addition to beer. You must be 21 or older to drink alcohol.\n\n\n\nWhere?\n\n• Realm is located at 148 Townsend between 2nd and 3rd.\n\n• An easy 15 minute walk from Moscone down 3rd St. (Map from Moscone)\n\n• A 5 minute walk from the King Street Caltrain station.  \n\n\n\nWhen?\n\n6:30pm: Doors, food, beer + range of non-alcoholic drinks \n\n7:30pm: Brain-wrenching quiz \n\n\n\nWho:\n\nYour host Nate Cook, a couple hundred (!!!) fiendish competitors, and the gracious folks at Realm.",
                    "address1": "Realm",
                    "address2": "148 Townsend St",
                    "address3": "San Francisco, CA 94107",
                    "latitude": 37.78002,
                    "longitude": -122.39216,
                    "url": "http://www.meetup.com/realm-sf/events/231250478/"
                },{
                    "objectId": "beard",
                    "icon": "https://gitcdn.link/repo/genadyo/WWDC/master/data/icons/beard.png",
                    "logo": "https://gitcdn.link/repo/genadyo/WWDC/master/data/logos/beard.jpg",
                    "title": "Beard Bash 2016",
                    "startDate": "2016-06-13T20:00",
                    "endDate": "2016-06-13T23:00",
                    "details": "Join Jim Dalrymple and iMore for an incredible night of music from The Department of Rock and headliners, Airplane Mode.\n\nYou must bring your RSVP to the venue in order to get entry into the party. You must be 21 because we will be serving free beer and wine throughout the night.\n\nPlease arrive early. Having an RSVP does not guarantee entry into the event.\n\nMany thanks to our sponsors, Pixelmator, MacPaw, Hover, and Microsoft, for making this party a reality!",
                    "address1": "The Mezzanine",
                    "address2": "444 Jessie Street",
                    "address3": "San Francisco, CA 94103",
                    "latitude": 37.7824,
                    "longitude": -122.408,
                    "url": "https://ti.to/jim-dalrymple/beard-bash-2016"
                }],
    "banners":  [{
                    "objectId": "caltrain",
                    "320": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/Caltrain_320.png",
                    "375": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/Caltrain_375.png",
                    "414": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/Caltrain_414.png",
                    "url": "https://itunes.apple.com/app/apple-store/id1077039589?pt=493817&ct=parties&mt=8"
                },{
                    "objectId": "BART",
                    "320": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/BART_320.png",
                    "375": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/BART_375.png",
                    "414": "https://gitcdn.link/repo/genadyo/WWDC/master/data/banners/BART_414.png",
                    "url": "https://itunes.apple.com/us/app/bart-schedule-and-planner/id1111913549?mt=8"
                }],
    "promotion": true
}



